<?php

namespace Database\Seeders;

use App\Models\User;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\Hash;

class UsersSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $password = Hash::make('password');
        for ($i = 0; $i < 100; $i++) {
            $name = $this->randomName();
            User::create([
                'name' => $name,
                'email' => "test+{$i}@posse-ap.com",
                'password' => $password,
            ]);
        }

        // 自分の名前を入れてね
        // $name = '';
        // User::create([
        //     'name' => $name,
        //     'password' => $password,
        //     'email' => "test+100@posse-ap.com",
        // ]);
    }

    private function firstNames()
    {
        return ['眞人','香与子','杏村','麻季','昌晃','ハンフリー','満香','香水','やゑ子','典利江','昌巳','夏央','彦三','哲央','佶','キヨコ','ケイジ','夏貴','佐知子','実茶','梅幸','長俊','真理雄','登久也','沙季','久敏','弘綱','しさ子','強志','英章','彩也子','忠四郎','眞理子','ミエ','由貴恵','冨美恵','早紀子','末武','悦司','悦司','其シン','文雄','市十郎','融吉','栄輝','広栄','文調','正善','早矢加','俊則','悪魔','幾三郎','かほ子','彰洋','柳作','五三','心','心','意次','吉治','吉治','吉治','博海','ヤチ子','昭仁','佐紀江','橙里','宏則','優香里','哲彌','よしひろ','末雄','末雄','初乃','武義','勝澄','敬止','ハル','章宏','シロー','昭武','悦郎','悦郎','むら子','邦郎','昭八郎','寅三郎','教子','教子','直円','友之助','ちどり','源次郎','孝志','聖人','聖人','あゆみ','勇孝','観樹','枴童','虎造','知紀','えりか','政紀','杏里沙','芳司','牧絵','盛長','正名','政勝','吉松','等顔','亀輔','國彦','基国','市子','巨泉','伸','伸','伸','千穂','登世子','登世子','千年','芝寿弥','龍子','勝英','和年','正武','光善','宏枝','烈','満亮','ホセ','為景','江梨','芸陽','実枝子','楽山','馬勝','ちゑこ','摩子','知幸','亀太郎','捷三'];
    }

    private function lastNames()
    {
        return ['三ツ藤','曽原','大川原','斑鳩','ワトソン','阿波根','阿波根','片田','倉崎','西澤','キムホク','愛野','佐浦','金光','金光','ミッチェル','浮穴','フルシチョフ','池之端','ハーディング','菊入','吉住','真行寺','尾川','関田','長浜屋','館田','早津','鷲津','天沼','室岡','小和田','小和田','穴部','川手','川手','ドスタム','苫前','嵐','南本','早船','福浜','平吹','高頭','升沢','秋吉','佐土原','堀田','堀田','堀田','河目','ラビロワ','稲見','土師','池口','八鹿','麦沢','土筆','高岳','高岳','三又','中埜','嘉藤','アガシ','水府','守分','足摺','ロステンコウスキ','石破','鬼無里','簑沢','高月','立花','千家','針間矢','小寺','小寺','但木','三倉','柏木','皆野','仲丸','長冨','鬼束','高島','小石澤','内館','三木','菱谷'];
    }

    private function randomName()
    {
        $first_names = $this->firstNames();
        $last_names = $this->lastNames();

        $first_name = $first_names[rand(0, count($first_names) - 1)];
        $last_name = $last_names[rand(0, count($last_names) - 1)];

        return $last_name . $first_name;
    }
}
